# ArePartsValidForMerge Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils..::..ArePartsValidForMerge Method
PartUtils Class See Also
---
Identifies whether Part elements may be merged.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool ArePartsValidForMerge(
	Document document,
	ICollection<ElementId> partIds
)
```

Visual Basic
---
```text
Public Shared Function ArePartsValidForMerge ( _
	document As Document, _
	partIds As ICollection(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
static bool ArePartsValidForMerge(
	Document^ document,
	ICollection<ElementId^>^ partIds
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
partIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> Element ids of Parts.
# ### Return Value
True if all element ids correspond to Part elements, none of the parts already has associated parts, the parts have contiguous geometry, all report the same materials, and all have the same creation and demolition phases.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartUtils Class
Autodesk.Revit.DB Namespace